t21/Walnut_X/Packages/.cache/Holtek.HT32_DFP.1.0.0.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Holtek</vendor>
  <name>HT32_DFP</name>
  <description>Holtek HT32 Family Support</description>
  <url>http://mcu.holtek.com.tw/pack</url>
  <!-- optional license file -->
  <!--
  <license>
  </license>
  -->

  <releases>
    <release version="1.0.4" date="2016-06-20">
      1. Update Datasheet and User Manual document.
      2. Update IROM size error
    </release>
    <release version="1.0.3" date="2016-04-14">
      1. Update HT32F52220/52230 document.
      2. Add 33QFN package information for HT32F52220/52230.
    </release>
    <release version="1.0.2" date="2016-03-03">
      Fix SVD error.
    </release>
    <release version="1.0.1" date="2016-02-16">
      Added: HT32F52331, HT32F52341, HT32F52342, HT32F52352 devices.
    </release>
    <release version="1.0.0" date="2015-03-23">
      First Release version of HT32 Device Family Pack.
      Contains the following Devices:HT32F1251,HT32F1253,HT32F1252,HT32F1251,HT32F1251B
                                     HT32F1755,HT32F1765,HT32F2755
                                     HT32F1655,HT32F1656,HT32F1653,HT32F1654
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>HOLTEK</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Holtek</keyword>
    <keyword>HT32 Family</keyword>
    <keyword>HT32</keyword>
  </keywords>

  <devices>
  <!-- ************************  Series 'HT32F125x'  **************************** -->
    <family Dfamily="HT32F125x Series" Dvendor="Holtek:106">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p0" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
      <description>
      Holtek HT32F125x series
      - ARM Cortex-M3 running at 72 MHz
      - From 8 to 31 Kbytes embedded Flash
      - From 2 to 8 Kbytes embedded SRAM
      - Almost all I/O pins are 5 V-tolerant
      - Up to 32 I/O lines
      Peripherals
      - Timer: RTC, 2 GPTM
      - Communication: SPI, USART, I2C
      - ADC: 12-bit ADC up to 8 channels
      Packages
      - 48pin LQFP
      </description>

      <feature type="XTAL"          n="4000000" m="16000000"/>
      <feature type="IntRC"         n="8000000"/>
      <feature type="RTC"           n="32768"/>
      <feature type="VCC"           n="2.70"    m="3.60"/>
      <feature type="Temp"          n="-40"     m="85"/>
      <feature type="PowerMode"     n="5"                     name="Run,Sleep,Deep-Sleep1,Deep-Sleep2,Power-Down"/>
      <feature type="ExtInt"        n="16"/>
      <feature type="WDT"           n="1"/>
      <feature type="Timer"         n="2"       m="16"        name="GPTM with Quadrature Decoder"/>
      <feature type="I2C"           n="1"/>
      <feature type="SPI"           n="1"/>
      <feature type="USART"         n="1"/>
      <feature type="ADC"           n="8"       m="12"/>
      <feature type="AnalogOther"   n="2"                     name="OPA/Comparator"/>
      <feature type="QFP"           n="48"                    name="LQFP48"/>

      <book    name="Documents/HT32F125x/HT32F125x_UserManualv130.pdf"            title="HT32F125x_UserManual"/>
      <book    name="Documents/HT32F125x/HT32F125xv120.pdf"                       title="HT32F125x Datasheet"/>

      <!-- *************************  Device 'HT32F1251B'  ***************************** -->
      <device Dname="HT32F1251B">
        <compile header="ARM/INC/Holtek/HT32F125x/ht32f125x.h"/>
        <debug      svd="SVD/HT32F125x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x2000"                   default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0400"                   default="0"/>
        <feature type="IOs"         n="30"/>
      </device>

      <!-- *************************  Device 'HT32F1251'  ***************************** -->
      <device Dname="HT32F1251">
        <compile header="ARM/INC/Holtek/HT32F125x/ht32f125x.h"/>
        <debug      svd="SVD/HT32F125x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"   	  start="0x00000000"  size="0x2000"                   default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0400"                   default="0"/>
        <feature type="IOs"         n="32"/>
       </device>

      <!-- *************************  Device 'HT32F1252'  ***************************** -->
      <device Dname="HT32F1252">
        <compile header="ARM/INC/Holtek/HT32F125x/ht32f125x.h"/>
        <debug      svd="SVD/HT32F125x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x4000"                   default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0400"                   default="0"/>
        <feature type="IOs"         n="32"/>
      </device>

      <!-- *************************  Device 'HT32F1253'  ***************************** -->
      <device Dname="HT32F1253">
        <compile header="ARM/INC/Holtek/HT32F125x/ht32f125x.h"/>
        <debug      svd="SVD/HT32F125x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x7C00"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x7C00"                   default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0400"                   default="0"/>
        <feature type="IOs"         n="32"/>
      </device>
    </family>

