t21/Walnut_X/Packages/.cache/Holtek.HT32_DFP.1.0.0.pdsc
  <!-- ************************  Series 'HT32F165x'  **************************** -->
    <family Dfamily="HT32F165x Series" Dvendor="Holtek:106">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p0" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
      <description>
      Holtek HT32F165x series
      - ARM Cortex-M3 running at 72 MHz
      - From 32 to 255 Kbytes embedded Flash
      - From 8 to 32 Kbytes embedded SRAM
      - Almost all I/O pins are 5 V-tolerant
      - Up to 80 I/O lines
      Peripherals
      - Timer: RTC, 2 BFTM, 2 GPTM, 2 MCTM
      - Communication: USB, I2S, SCI, 2 SPI, 2 UART, 2 USART, 2 I2C
      - Extend Bus Interface(EBI)
      - Cyclic Redundancy Check(CRC-16/32)
      - ADC: 12-bit ADC up to 16 channels
      Packages
      - 48/64/100-pin LQFP
      </description>

      <feature type="XTAL"          n="4000000" m="16000000"/>
      <feature type="IntRC"         n="8000000"/>
      <feature type="RTC"           n="32768"/>
      <feature type="VCC"           n="2.70"    m="3.60"/>
      <feature type="Temp"          n="-40"     m="85"/>
      <feature type="PowerMode"     n="5"                     name="Run,Sleep,Deep-Sleep1,Deep-Sleep2,Power-Down"/>
      <feature type="ExtInt"        n="16"/>
      <feature type="WDT"           n="1"/>
      <feature type="DMA"           n="8"                     name="High-Speed DMA"/>
      <feature type="Timer"         n="2"     m="16"          name="GPTM with Quadrature Decoder"/>
      <feature type="Timer"         n="2"     m="16"          name="MCTM with Complementary Outputs"/>
      <feature type="Timer"         n="2"     m="32"          name="BFTM"/>
      <feature type="I2C"           n="2"/>
      <feature type="I2S"           n="1"/>
      <feature type="SPI"           n="2"/>
      <feature type="UART"          n="2"/>
      <feature type="USART"         n="2"/>
      <feature type="USBD"          n="1"/>
      <feature type="ComOther"      n="1"                     name="SCI"/>
      <feature type="ExtBus"        n="16"                    name="EBI"/>
      <feature type="Other"         n="1"                     name="CRC"/>

      <!-- *************************  Device 'HT32F1653'  ***************************** -->
      <device Dname="HT32F1653">
        <compile header="ARM/INC/Holtek/HT32F1653_54/ht32f1653_54.h"/>
        <debug      svd="SVD/HT32F1653_54.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x8000"                   default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0400"                   default="0"/>
        <book    name="Documents/HT32F1653_54/HT32F1653-1654_UserManualv100.pdf"            title="HT32F1653-54_UserManual"/>
        <book    name="Documents/HT32F1653_54/HT32F1653_1654_DataSheetv100.pdf"             title="HT32F1653-54 Datasheet"/>
        <feature type="QFP"         n="64"                    name="LQFP64"/>
        <feature type="QFP"         n="48"                    name="LQFP48"/>
        <feature type="ADC"         n="12"  m="12"/>
        <feature type="IOs"         n="51"/>
        <feature type="AnalogOther" n="2"                     name="Comparator"/>
      </device>

      <!-- *************************  Device 'HT32F1654'  ***************************** -->
      <device Dname="HT32F1654">
        <compile header="ARM/INC/Holtek/HT32F1653_54/ht32f1653_54.h"/>
        <debug      svd="SVD/HT32F1653_54.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0xFC00"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0xFC00"                   default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0400"                   default="0"/>
        <book    name="Documents/HT32F1653_54/HT32F1653-1654_UserManualv100.pdf"            title="HT32F1653-54_UserManual"/>
        <book    name="Documents/HT32F1653_54/HT32F1653_1654_DataSheetv100.pdf"             title="HT32F1653-54 Datasheet"/>
        <feature type="QFP"         n="64"                    name="LQFP64"/>
        <feature type="QFP"         n="48"                    name="LQFP48"/>
        <feature type="ADC"         n="12"  m="12"/>
        <feature type="IOs"         n="51"/>
        <feature type="AnalogOther" n="2"                     name="Comparator"/>
      </device>

      <!-- *************************  Device 'HT32F1655'  ***************************** -->
      <device Dname="HT32F1655">
        <compile header="ARM/INC/Holtek/HT32F1655_56/ht32f1655_56.h"/>
        <debug      svd="SVD/HT32F1655_56.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0400"                   default="0"/>
        <book    name="Documents/HT32F1655_56/HT32F1655-1656_UserManualv100.pdf"            title="HT32F1655_56 UserManual"/>
        <book    name="Documents/HT32F1655_56/HT32F1655-1656_Datasheetv100.pdf"             title="HT32F1655_56 Datasheet"/>
        <feature type="QFP"         n="64"                    name="LQFP64"/>
        <feature type="QFP"         n="48"                    name="LQFP48"/>
        <feature type="QFP"         n="100"                   name="LQFP100"/>
        <feature type="ADC"         n="16"  m="12"/>
        <feature type="IOs"         n="80"/>
        <feature type="AnalogOther" n="2"                     name="OPA/Comparator"/>
      </device>

