t21/Walnut_X/Packages/.cache/Holtek.HT32_DFP.1.0.0.pdsc
      <!-- *************************  Device 'HT32F1656'  ***************************** -->
      <device Dname="HT32F1656">
        <compile header="ARM/INC/Holtek/HT32F1655_56/ht32f1655_56.h"/>
        <debug      svd="SVD/HT32F1655_56.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x3FC00"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x3FC00"                  default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0400"                   default="0"/>
        <book    name="Documents/HT32F1655_56/HT32F1655-1656_UserManualv100.pdf"            title="HT32F1655_56 UserManual"/>
        <book    name="Documents/HT32F1655_56/HT32F1655-1656_Datasheetv100.pdf"             title="HT32F1655_56 Datasheet"/>
        <feature type="QFP"         n="64"                    name="LQFP64"/>
        <feature type="QFP"         n="48"                    name="LQFP48"/>
        <feature type="QFP"         n="100"                   name="LQFP100"/>
        <feature type="ADC"         n="16"  m="12"/>
        <feature type="IOs"         n="80"/>
        <feature type="AnalogOther" n="2"                     name="OPA/Comparator"/>
      </device>
    </family>

  <!-- ************************  Series 'HT32F175x'  **************************** -->
    <family Dfamily="HT32F175x Series" Dvendor="Holtek:106">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p0" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
      <description>
      Holtek HT32 175x series
      - ARM Cortex-M3 running at 72 MHz
      - 127 Kbytes embedded Flash
      - From 32 to 64 Kbytes embedded SRAM
      - Almost all I/O pins are 5 V-tolerant
      - Up to 80 I/O lines
      Peripherals
      - Timer: RTC, 2 BFTM, 2 GPTM, 1 MCTM
      - Communication: USB, SCI, 2 SPI, 2 USART, 2 I2C
      - ADC: 12-bit ADC up to 8 channels
      Packages
      - 48/64/100-pin LQFP
      </description>

      <feature type="XTAL"          n="4000000" m="16000000"/>
      <feature type="IntRC"         n="8000000"/>
      <feature type="RTC"           n="32768"/>
      <feature type="VCC"           n="2.70"    m="3.60"/>
      <feature type="Temp"          n="-40"     m="85"/>
      <feature type="PowerMode"     n="5"                     name="Run,Sleep,Deep-Sleep1,Deep-Sleep2,Power-Down"/>
      <feature type="ExtInt"        n="16"/>
      <feature type="WDT"           n="1"/>
      <feature type="DMA"           n="12"                    name="High-Speed DMA"/>
      <feature type="Timer"         n="2"     m="16"          name="GPTM with Quadrature Decoder"/>
      <feature type="Timer"         n="1"     m="16"          name="MCTM with Complementary Outputs"/>
      <feature type="Timer"         n="2"     m="32"          name="BFTM"/>
      <feature type="I2C"           n="2"/>
      <feature type="SPI"           n="2"/>
      <feature type="USART"         n="2"/>
      <feature type="USBD"          n="1"/>
      <feature type="ComOther"      n="1"                     name="SCI"/>
      <feature type="ADC"           n="8"     m="12"/>
      <feature type="AnalogOther"   n="2"                     name="OPA/Comparator"/>
      <feature type="IOs"           n="80"/>
      <feature type="QFP"           n="100"                   name="LQFP100"/>
      <feature type="QFP"           n="64"                    name="LQFP64"/>
      <feature type="QFP"           n="48"                    name="LQFP48"/>

      <book    name="Documents/HT32F175x_275x/HT32F1755-1765-2755_UserManualv110.pdf"            title="HT32F175x_UserManual"/>
      <book    name="Documents/HT32F175x_275x/HT32F1755-1765-2755_Datasheetv120.pdf"             title="HT32F175x Datasheet"/>

      <!-- *************************  Device 'HT32F1755'  ***************************** -->
      <device Dname="HT32F1755">
        <compile    header="ARM/INC/Holtek/HT32F175x_275x/ht32f175x_275x.h"/>
        <debug      svd="SVD/HT32F175x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0400"                   default="0"/>
      </device>

      <!-- *************************  Device 'HT32F1765'  ***************************** -->
      <device Dname="HT32F1765">
        <compile    header="ARM/INC/Holtek/HT32F175x_275x/ht32f175x_275x.h"/>
        <debug      svd="SVD/HT32F175x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0400"                   default="0"/>
      </device>
    </family>

  <!-- ************************  Series 'HT32F2755'  **************************** -->
    <family Dfamily="HT32F2755 Series" Dvendor="Holtek:106">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p0" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
      <description>
      Holtek HT32 2755 ASSP MCU
      - ARM Cortex-M3 running at 72 MHz
      - 127 Kbytes embedded Flash
      - 32  Kbytes embedded SRAM
      - Almost all I/O pins are 5 V-tolerant
      - Up to 80 I/O lines
      Peripherals
      - CMOS Sensor Interface(CSIF)
      - Timer: RTC, 2 BFTM, 2 GPTM, 1 MCTM
      - Communication: USB, SCI, 2 SPI, 2 USART, 2 I2C
      - ADC: 12-bit ADC up to 8 channels
      Packages
      - 48/64/100-pin LQFP
      </description>

      <feature type="XTAL"          n="4000000"	m="16000000"/>
      <feature type="IntRC"         n="8000000"/>
      <feature type="RTC"           n="32768"/>
      <feature type="VCC"           n="2.70"    m="3.60"/>
      <feature type="Temp"          n="-40"     m="85"/>
      <feature type="PowerMode"     n="5"                   name="Run,Sleep,Deep-Sleep1,Deep-Sleep2,Power-Down"/>
      <feature type="ExtInt"        n="16"/>
      <feature type="WDT"           n="1"/>
      <feature type="DMA"           n="12"                  name="High-Speed DMA"/>
      <feature type="Timer"         n="2"       m="16"      name="GPTM with Quadrature Decoder"/>
      <feature type="Timer"         n="1"       m="16"      name="MCTM with Complementary Outputs"/>
      <feature type="Timer"         n="2"       m="32"      name="BFTM"/>
      <feature type="I2C"           n="2"/>
      <feature type="SPI"           n="2"/>
      <feature type="USART"         n="2"/>
      <feature type="USBD"          n="1"/>
      <feature type="ComOther"      n="1"                   name="SCI"/>
      <feature type="ComOther"      n="1"                   name="CSIF"/>
      <feature type="ADC"           n="8"      m="12"/>
      <feature type="AnalogOther"   n="2"                   name="OPA/Comparator"/>
      <feature type="IOs"           n="80"/>
      <feature type="QFP"           n="100"                 name="LQFP100"/>
      <feature type="QFP"           n="64"                  name="LQFP64"/>
      <feature type="QFP"           n="48"                  name="LQFP48"/>

      <book    name="Documents/HT32F175x_275x/HT32F1755-1765-2755_UserManualv110.pdf"            title="HT32F275x_UserManual"/>
      <book    name="Documents/HT32F175x_275x/HT32F1755-1765-2755_Datasheetv120.pdf"             title="HT32F275x Datasheet"/>

      <!-- *************************  Device 'HT32F2755'  ***************************** -->
      <device Dname="HT32F2755">
        <compile    header="ARM/INC/Holtek/HT32F175x_275x/ht32f175x_275x.h"/>
        <debug      svd="SVD/HT32F175x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0400"                   default="0"/>
      </device>
    </family>

  <!-- ************************  Series 'HT32F522xx'  **************************** -->
    <family Dfamily="HT32F522xx Series" Dvendor="Holtek:106">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="40000000"/>
      <description>
      Holtek HT32F522xx series
      - ARM Cortex-M0+ running at 40 MHz
      - From 16 to 64 Kbytes embedded Flash
      - From 2 to 8 Kbytes embedded SRAM
      - Up to 40 I/O lines
      Peripherals
      - Timer: RTC, 2 BFTM, 4 SCTM, 1 GPTM, 1 MCTM
      - Communication: 2 SPI, 2 UART, 1 USART, 2 I2C
      - Cyclic Redundancy Check(CRC-16/32)
      - ADC: 12-bit ADC up to 12 channels
      Packages
      - 24/28-pin SSOP
      - 33-pin QFN
      - 48-pin LQFP
      </description>

      <feature type="XTAL"        n="4000000" m="16000000"/>
      <feature type="IntRC"       n="8000000"/>
      <feature type="RTC"         n="32768"/>
      <feature type="VCC"         n="2.00"    m="3.60"/>
      <feature type="Temp"        n="-40"     m="85"/>
      <feature type="PowerMode"   n="5"                     name="Run,Sleep,Deep-Sleep1,Deep-Sleep2,Power-Down"/>
      <feature type="ExtInt"      n="16"/>
      <feature type="WDT"         n="1"/>
      <feature type="USART"       n="1"/>

