t21/Walnut_X/Packages/.cache/Holtek.HT32_DFP.1.0.0.pdsc
      <!-- *************************  Device 'HT32F52331'  ***************************** -->
      <device Dname="HT32F52331">
        <compile header="ARM/INC/Holtek/HT32F520xx/ht32f520xx_01.h"/>
        <debug      svd="SVD/HT32F52331_41.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x8000"                   default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0200"                   default="0"/>
        <book    name="Documents/HT32F520xx/HT32F52231-41_HT32F52331-41_UserManualv110.pdf"    title="HT32F52331/41 UserManual"/>
        <book    name="Documents/HT32F520xx/HT32F52231-41_HT32F52331-41_Datasheetv110.pdf"     title="HT32F52331/41 Datasheet"/>
        <feature type="Timer"       n="4"     m="16"          name="SCTM with single PWM"/>
        <feature type="Timer"       n="1"     m="16"          name="GPTM with Quadrature Decoder"/>
        <feature type="USART"       n="1"/>
        <feature type="ComOther"    n="1"                     name="SCI"/>
        <feature type="QFN"         n="33"                    name="QFN33"/>
        <feature type="QFP"         n="48"                    name="LQFP48"/>
        <feature type="IOs"         n="38"/>
      </device>

      <!-- *************************  Device 'HT32F52341'  ***************************** -->
      <device Dname="HT32F52341">
        <compile header="ARM/INC/Holtek/HT32F520xx/ht32f520xx_01.h"/>
        <debug      svd="SVD/HT32F52331_41.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0xFE00"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x10000"                  default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0200"                   default="0"/>
        <book    name="Documents/HT32F520xx/HT32F52231-41_HT32F52331-41_UserManualv110.pdf"    title="HT32F52331/41 UserManual"/>
        <book    name="Documents/HT32F520xx/HT32F52231-41_HT32F52331-41_Datasheetv110.pdf"     title="HT32F52331/41 Datasheet"/>
        <feature type="Timer"       n="4"     m="16"          name="SCTM with single PWM"/>
        <feature type="Timer"       n="1"     m="16"          name="GPTM with Quadrature Decoder"/>
        <feature type="USART"       n="1"/>
        <feature type="ComOther"    n="1"                     name="SCI"/>
        <feature type="QFN"         n="33"                    name="QFN33"/>
        <feature type="QFP"         n="48"                    name="LQFP48"/>
        <feature type="IOs"         n="38"/>
      </device>

      <!-- *************************  Device 'HT32F52342'  ***************************** -->
      <device Dname="HT32F52342">
        <compile header="ARM/INC/Holtek/HT32F520xx/ht32f520xx_01.h"/>
        <debug      svd="SVD/HT32F52342_52.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x10000"                  default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0200"                   default="0"/>
        <book    name="Documents/HT32F520xx/HT32F52342-52_UserManualv110.pdf"             title="HT32F52342/52 UserManual"/>
        <book    name="Documents/HT32F520xx/HT32F52342-52_Datasheetv100.pdf"              title="HT32F52342/52 Datasheet"/>
        <feature type="Timer"       n="2"     m="16"          name="SCTM with single PWM"/>
        <feature type="Timer"       n="2"     m="16"          name="GPTM with Quadrature Decoder"/>
        <feature type="USART"       n="2"/>
        <feature type="ComOther"    n="2"                     name="SCI"/>
        <feature type="DMA"         n="6"                     name="High-Speed DMA"/>
        <feature type="ExtBus"      n="16"                    name="EBI"/>
        <feature type="I2S"         n="1"/>
        <feature type="AnalogOther" n="2"                     name="Comparator"/>
        <feature type="QFP"         n="48"                    name="LQFP48"/>
        <feature type="QFP"         n="64"                    name="LQFP64"/>
        <feature type="IOs"         n="51"/>
      </device>

      <!-- *************************  Device 'HT32F52352'  ***************************** -->
      <device Dname="HT32F52352">
        <compile header="ARM/INC/Holtek/HT32F520xx/ht32f520xx_01.h"/>
        <debug      svd="SVD/HT32F52342_52.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x1fe00"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0200"                   default="0"/>
        <book    name="Documents/HT32F520xx/HT32F52342-52_UserManualv110.pdf"             title="HT32F52342/52 UserManual"/>
        <book    name="Documents/HT32F520xx/HT32F52342-52_Datasheetv100.pdf"              title="HT32F52342/52 Datasheet"/>
        <feature type="Timer"       n="2"     m="16"          name="SCTM with single PWM"/>
        <feature type="Timer"       n="2"     m="16"          name="GPTM with Quadrature Decoder"/>
        <feature type="USART"       n="2"/>
        <feature type="ComOther"    n="2"                     name="SCI"/>
        <feature type="DMA"         n="6"                     name="High-Speed DMA"/>
        <feature type="ExtBus"      n="16"                    name="EBI"/>
        <feature type="I2S"         n="1"/>
        <feature type="AnalogOther" n="2"                     name="Comparator"/>
        <feature type="QFP"         n="48"                    name="LQFP48"/>
        <feature type="QFP"         n="64"                    name="LQFP64"/>
        <feature type="IOs"         n="51"/>
      </device>
    </family>

  </devices>

  <conditions>
    <condition id="Compiler ARM">                                             <!-- conditions selecting ARM Compiler -->
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="HT32Fxxxx CMSIS Device">                                   <!-- conditions selecting Devices -->
      <description>Holtek HT32F1xxx device series, CMSIS-CORE, and ARMCC compiler</description>
      <require Cclass ="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Holtek:106" Dname="HT32F[1256]*"/>
    </condition>

    <condition id="HT32F125x">
      <description>Holtek Cortex-M3 Standard MCU Low Density Device</description>
      <accept Dname="HT32F125[123]*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F175x">
      <description>Holtek Cortex-M3 Standard MCU Mid Density Device</description>
      <accept Dname="HT32F17[56]5"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F1653_54">
      <description>Holtek Cortex-M3 Standard MCU Mid Density Device</description>
      <accept Dname="HT32F165[34]"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F1655_56">
      <description>Holtek Cortex-M3 Standard MCU High Density Device</description>
      <accept Dname="HT32F165[56]"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F2755">
      <description>Holtek Cortex-M3 ASSP Device</description>
      <accept Dname="HT32F2755"/>
      <require condition="Compiler ARM"/>
    </condition>

