t21/Walnut_X/Packages/.cache/Holtek.HT32_DFP.1.0.0.pdsc
    <condition id="HT32F52220_30">
      <description>Holtek Cortex-M0+ Standard MCU Value Line</description>
      <accept Dname="HT32F522[23]0"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F52231_41">
      <description>Holtek Cortex-M0+ Standard MCU Value Line</description>
      <accept Dname="HT32F522[34]1"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F52331_41">
      <description>Holtek Cortex-M0+ Standard MCU USB Line</description>
      <accept Dname="HT32F523[34]1"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F52342_52">
      <description>Holtek Cortex-M0+ Standard MCU USB Line</description>
      <accept Dname="HT32F523[45]2"/>
      <require condition="Compiler ARM"/>
    </condition>


  </conditions>


  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.1" condition="HT32Fxxxx CMSIS Device">  <!-- Cversion is necessary -->
      <description>System Startup for Holtek HT32 Family device</description>
      <files>
        <!--  include folder -->
        <file category="include" name="ARM/INC/Holtek/HT32F125x/"/>
        <file category="include" name="ARM/INC/Holtek/HT32F175x_275x/"/>
        <file category="include" name="ARM/INC/Holtek/HT32F1653_54/"/>
        <file category="include" name="ARM/INC/Holtek/HT32F1655_56/"/>
        <file category="include" name="ARM/INC/Holtek/HT32F520xx/"/>

        <!-- startup files -->
        <file category="source" name="ARM/Startup/Holtek/HT32F125x/startup_ht32f125x.s"           attr="config"    condition="HT32F125x" version="1.0.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F175x_275x/startup_ht32f175x_275x.s" attr="config"    condition="HT32F175x" version="1.0.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F175x_275x/startup_ht32f175x_275x.s" attr="config"    condition="HT32F2755" version="1.0.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F165x/startup_ht32f165x.s"           attr="config"    condition="HT32F1653_54" version="1.0.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F165x/startup_ht32f165x.s"           attr="config"    condition="HT32F1655_56" version="1.0.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F520xx/startup_ht32f52220_30.s"      attr="config"    condition="HT32F52220_30" version="1.0.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F520xx/startup_ht32f52231_41.s"      attr="config"    condition="HT32F52231_41" version="1.0.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F520xx/startup_ht32f52331_41.s"      attr="config"    condition="HT32F52331_41" version="1.0.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F520xx/startup_ht32f52342_52.s"      attr="config"    condition="HT32F52342_52" version="1.0.0"/>

        <!-- system file -->
        <file category="source" name="ARM/Startup/Holtek/HT32F125x/system_ht32f125x.c"            attr="config"    condition="HT32F125x" version="1.0.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F175x_275x/system_ht32f175x_275x.c"  attr="config"    condition="HT32F175x" version="1.0.1"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F175x_275x/system_ht32f175x_275x.c"  attr="config"    condition="HT32F2755" version="1.0.1"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F165x/system_ht32f1653_54.c"         attr="config"    condition="HT32F1653_54" version="1.0.1"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F165x/system_ht32f1655_56.c"         attr="config"    condition="HT32F1655_56" version="1.0.1"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F520xx/system_ht32f520xx_01.c"       attr="config"    condition="HT32F52331_41" version="1.0.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F520xx/system_ht32f520xx_01.c"       attr="config"    condition="HT32F52342_52" version="1.0.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F520xx/system_ht32f520xx_02.c"       attr="config"    condition="HT32F52220_30" version="1.0.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F520xx/system_ht32f520xx_02.c"       attr="config"    condition="HT32F52231_41" version="1.0.0"/>

        <!-- device configuration required by drivers at the moment -->
      </files>
    </component>
  </components>

</package>
